cask_args appdir: "/Applications"

tap "aquasecurity/trivy"
tap "fluxcd/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "mike-engel/jwt-cli"
tap "sigstore/tap"
tap "superbrothers/zsh-kubectl-prompt"
tap "weaveworks/tap"
tap "hashicorp/tap"
tap "felixkratz/formulae"
tap "koekeishiya/formulae"
tap "venafi/tap"

# General
brew "coreutils"
brew "git"
brew "yubikey-agent", restart_service: true
brew "nmap"
brew "tmux"
brew "wget"
brew "zsh"
brew "jq"
brew "hg"
brew "direnv"
brew "telnet"
brew "htop"
brew "watch"
brew "mosh"
brew "gnu-getopt"
brew "grpcurl"
brew "mysql-client"
brew "mike-engel/jwt-cli/jwt-cli"
brew "1password-cli"
brew "socat"
brew "gnu-sed"

# Window management
brew "felixkratz/formulae/sketchybar", restart_service: true
brew "felixkratz/formulae/borders", restart_service: true
brew "koekeishiya/formulae/skhd", restart_service: true
brew "koekeishiya/formulae/yabai", restart_service: true
brew "blueutil"
brew "switchaudio-osx"
brew "wifi-password"

# Automation
brew "ansible"

# Cloud
brew "awscli"
brew "azure-cli"
cask "google-cloud-sdk"

# Programming
brew "go"
brew "golangci-lint"
brew "protobuf"

brew "node"

# Docker
brew "colima", restart_service: true
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "skopeo"

# kubernetes
brew "kubernetes-cli"
brew "helm"
brew "kubectx"
brew "superbrothers/zsh-kubectl-prompt/zsh-kubectl-prompt"
brew "istioctl"
brew "sops"
brew "fluxcd/tap/flux"
brew "cmctl"
brew "eksctl"
brew "istioctl"
brew "kind"
brew "k9s"
brew "kumactl"

# Hashicorp
brew "hashicorp/tap/vault"
brew "hashicorp/tap/packer"
brew "hashicorp/tap/terraform"

# Software Supply Chain
brew "aquasecurity/trivy/trivy"
brew "sigstore/tap/gitsign"
brew "sigstore/tap/rekor-cli"
brew "scorecard"

# Certificates
brew "certigo"
brew "venafi/tap/vcert"

# # GPG
# brew "pinentry-mac"

# Applications
cask "spotify"
cask "visual-studio-code"
cask "iterm2"
cask "kitty"

# Fonts
cask "font-fontawesome"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-source-code-pro"
cask "sf-symbols"

# VS Code Extensions
vscode "adpyke.codesnap"
vscode "bierner.markdown-mermaid"
vscode "davidanson.vscode-markdownlint"
vscode "eamodio.gitlens"
vscode "github.codespaces"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "james-yu.latex-workshop"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "redhat.vscode-yaml"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-british-english"
vscode "technosophos.vscode-helm"
vscode "timonwong.shellcheck"
# Pastebot
# Pocket
# Twitter
# utorrent
# Reeder
# Trello
# Lanscan
# Magnet
