cask_args appdir: "/Applications"

tap "homebrew/cask"
tap "superbrothers/zsh-kubectl-prompt"

# General
brew "git"
brew "yubikey-agent"
brew "nmap"
brew "tmux"
brew "wget"
brew "zsh"
brew "jq"
brew "hg"
brew "direnv"
brew "telnet"
brew "htop"
brew "watch"
brew "mosh"
brew "neofetch"

# Automation
brew "ansible"

# Cloud
brew "awscli"
brew "azure-cli"
cask "google-cloud-sdk"

# Programming
brew "go"

# Collaboration
brew "tmate"

# kubernetes
brew "kubernetes-cli"
brew "helm"
brew "kubectx"
brew "zsh-kubectl-prompt" #From custom tap
brew "istioctl"
brew "sops"
brew "gnu-getopt"

# Hashicorp
brew "vault"
brew "packer"
brew "terraform"
brew "consul"

# # GPG
# brew "pinentry-mac"

# Applications
cask "google-chrome"
cask "slack"
cask "spotify"
cask "visual-studio-code"
cask "1password"
cask "vlc"
cask "iterm2"
cask "firefox"
# cask "docker"

# Pastebot
# Pocket
# Twitter
# utorrent
# Reeder
# Trello
# Lanscan
# Magnet
