tap "aquasecurity/trivy"
tap "felixkratz/formulae"
tap "fluxcd/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "mike-engel/jwt-cli"
tap "sigstore/tap"
tap "superbrothers/zsh-kubectl-prompt"
tap "vitobotta/tap"
tap "weaveworks/tap"
brew "icu4c@76"
brew "openssl@3"
brew "node"
brew "angular-cli"
brew "ansible"
brew "awscli"
brew "azure-cli"
brew "libssh2"
brew "bat"
brew "blueutil"
brew "cmctl"
brew "lima"
brew "colima", restart_service: :changed
brew "colordiff"
brew "gmp"
brew "coreutils"
brew "crystal"
brew "diceware"
brew "direnv"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "eksctl"
brew "fzf"
brew "ghostscript"
brew "git"
brew "gnu-getopt"
brew "gnu-tar"
brew "go"
brew "grpcurl"
brew "helm"
brew "htop"
brew "hugo"
brew "istioctl"
brew "jq"
brew "kind"
brew "kubernetes-cli"
brew "kubectx"
brew "mpfr"
brew "libmpc"
brew "mercurial"
brew "mosh"
brew "mpc"
brew "mysql-client"
brew "neofetch"
brew "nmap"
brew "qemu"
brew "ripgrep"
brew "scorecard"
brew "skopeo"
brew "sops"
brew "spaceship"
brew "sshpass"
brew "switchaudio-osx"
brew "telnet"
brew "tmux"
brew "tree"
brew "watch"
brew "wget"
brew "wifi-password"
brew "yq"
brew "yubikey-agent", restart_service: :changed
brew "zsh"
brew "zsh-syntax-highlighting"
brew "aquasecurity/trivy/trivy"
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"
brew "fluxcd/tap/flux"
brew "hashicorp/tap/packer"
brew "hashicorp/tap/terraform"
brew "hashicorp/tap/vault"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "mike-engel/jwt-cli/jwt-cli"
brew "sigstore/tap/gitsign"
brew "sigstore/tap/rekor-cli"
brew "superbrothers/zsh-kubectl-prompt/zsh-kubectl-prompt"
brew "vitobotta/tap/hetzner_k3s"
cask "1password-cli"
cask "discord"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "google-cloud-sdk", args: { appdir: "/Applications" }
cask "sf-symbols"
cask "spotify", args: { appdir: "/Applications" }
cask "visual-studio-code", args: { appdir: "/Applications" }
vscode "bierner.markdown-mermaid"
vscode "davidanson.vscode-markdownlint"
vscode "eamodio.gitlens"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "james-yu.latex-workshop"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode.makefile-tools"
vscode "redhat.vscode-yaml"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-british-english"
vscode "technosophos.vscode-helm"
